#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.policy_definitions.azurerm_policy_definition.websiteSlot_http5xx: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_http5xx]
module.policy_definitions.azurerm_policy_definition.sqlServerDB_deadlock: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlServerDB_deadlock]
module.policyset_definitions.azurerm_policy_set_definition.logging_governance_prod: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/logging_governance_prod]
module.policy_definitions.azurerm_policy_definition.websiteSlot_averageResponseTime: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_averageResponseTime]
module.policy_definitions.azurerm_policy_definition.sqlServerDB_cpuPercent: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlServerDB_cpuPercent]
module.policyset_definitions.azurerm_policy_set_definition.logging_governance_dev: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/logging_governance_dev]
module.policy_definitions.azurerm_policy_definition.websiteSlot_healthCheckStatus: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_healthCheckStatus]
module.policy_assignments.azurerm_subscription_policy_assignment.logging_governance_prod: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/logging_governance_prod]
module.policy_assignments.azurerm_role_assignment.logging_governance_prod: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleAssignments/52c565a9-c475-2d56-021f-68d493c46458]
module.policy_definitions.azurerm_policy_definition.sqlServerDB_blockedByFirewall: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlServerDB_blockedByFirewall]
module.policy_definitions.azurerm_policy_definition.appGateway_cpuUtilization: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_cpuUtilization]
module.policy_definitions.azurerm_policy_definition.websiteSlot_cpuTime: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_cpuTime]
module.policy_definitions.azurerm_policy_definition.sqlManagedInstances_avgCPUPercent: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlManagedInstances_avgCPUPercent]
module.policy_definitions.azurerm_policy_definition.website_http5xx: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_http5xx]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuitPeer_bitsOutPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuitPeer_bitsOutPerSecond]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuit_bitsInPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuit_bitsInPerSecond]
module.policy_definitions.azurerm_policy_definition.websvrfarm_memoryPercentage: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websvrfarm_memoryPercentage]
module.policy_definitions.azurerm_policy_definition.sqlManagedInstances_ioRequests: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlManagedInstances_ioRequests]
module.policy_definitions.azurerm_policy_definition.sqlServerDB_storagePercent: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlServerDB_storagePercent]
module.policy_definitions.azurerm_policy_definition.expressRouteGateway_bitsOutPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteGateway_bitsOutPerSecond]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[3]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_ManagedBy_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.appGateway_clientRTT: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_ClientRtt]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[5]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Support_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[1]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_CostCentre_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[4]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Owner_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[2]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Environment_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRGOverwriteExisting[0]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Application_OverwriteExisting]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuitPeer_bitsInPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuitPeer_bitsInPerSecond]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[0]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Application]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[2]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Environment]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[1]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_CostCentre]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[5]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Support]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[4]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_Owner]
module.policy_definitions.azurerm_policy_definition.inheritTagFromRG[3]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/inheritTagFromRG_ManagedBy]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuit_arpAvailability: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuit_arpAvailability]
module.policy_definitions.azurerm_policy_definition.website_healthCheckStatus: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_healthCheckStatus]
module.policy_definitions.azurerm_policy_definition.website_averageResponseTime: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_averageResponseTime]
module.policy_definitions.azurerm_policy_definition.azureFirewall_health: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/azureFirewall_health]
module.policy_definitions.azurerm_policy_definition.websiteSlot_requestsInApplicationQueue: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_requestsInApplicationQueue]
module.policy_definitions.azurerm_policy_definition.website_averageMemoryWorkingSet: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_averageMemoryWorkingSet]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuit_bitsOutPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuit_bitsOutPerSecond]
module.policy_definitions.azurerm_policy_definition.auditRoleAssignmentType_user: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/auditRoleAssignmentType_user]
module.policy_definitions.azurerm_policy_definition.auditLockOnNetworking: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/auditLockOnNetworking]
module.policy_definitions.azurerm_policy_definition.appGateway_unhealthyHostCount: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_unhealthyHostCount]
module.policy_definitions.azurerm_policy_definition.loadBalancer_vipAvailability: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/loadBalancer_vipAvailability]
module.policy_definitions.azurerm_policy_definition.appGateway_healthyHostCount: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_healthyHostCount]
module.policy_definitions.azurerm_policy_definition.bulkInheritTagsFromRG: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/bulkInheritTagsFromRG]
module.policy_definitions.azurerm_policy_definition.website_cpuTime: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_cpuTime]
module.policy_definitions.azurerm_policy_definition.addTagToRG[5]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_Support]
module.policy_definitions.azurerm_policy_definition.addTagToRG[3]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_ManagedBy]
module.policy_definitions.azurerm_policy_definition.addTagToRG[0]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_Application]
module.policy_definitions.azurerm_policy_definition.addTagToRG[4]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_Owner]
module.policy_definitions.azurerm_policy_definition.addTagToRG[1]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_CostCentre]
module.policy_definitions.azurerm_policy_definition.websvrfarm_cpuPercentage: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websvrfarm_cpuPercentage]
module.policy_definitions.azurerm_policy_definition.addTagToRG[2]: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/addTagToRG_Environment]
module.policy_definitions.azurerm_policy_definition.websiteSlot_averageMemoryWorkingSet: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/websiteSlot_averageMemoryWorkingSet]
module.policy_definitions.azurerm_policy_definition.website_requestsInApplicationQueue: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/website_requestsInApplicationQueue]
module.policy_definitions.azurerm_policy_definition.expressRouteGateway_bitsInPerSecond: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteGateway_bitsInPerSecond]
module.policy_definitions.azurerm_policy_definition.loadBalancer_dipAvailability: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/loadBalancer_dipAvailability]
module.policy_definitions.azurerm_policy_definition.expressRouteCircuit_bgpAvailability: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/expressRouteCircuit_bgpAvailability]
module.policy_definitions.azurerm_policy_definition.appGateway_failedRequests: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_failedRequests]
module.policy_definitions.azurerm_policy_definition.appGateway_totalRequests: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/appGateway_totalRequests]
module.policy_definitions.azurerm_policy_definition.sqlServerDB_connectionFailed: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyDefinitions/sqlServerDB_connectionFailed]
module.policyset_definitions.azurerm_policy_set_definition.data_protection_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/data_protection_governance]
module.policyset_definitions.azurerm_policy_set_definition.tag_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/tag_governance]
module.policyset_definitions.azurerm_policy_set_definition.iam_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/iam_governance]
module.policy_assignments.azurerm_subscription_policy_assignment.data_protection_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/data_protection_governance]
module.policyset_definitions.azurerm_policy_set_definition.monitoring_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/monitoring_governance]
module.policyset_definitions.azurerm_policy_set_definition.security_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/security_governance]
module.policy_assignments.azurerm_subscription_policy_assignment.iam_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/iam_governance]
module.policy_assignments.azurerm_subscription_policy_assignment.tag_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/tag_governance]
module.policy_assignments.azurerm_subscription_policy_assignment.security_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/security_governance]
module.policy_assignments.azurerm_role_assignment.tag_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleAssignments/aec92389-bbd6-0278-ebf1-e97ced3a6aa3]
module.policy_assignments.azurerm_subscription_policy_assignment.monitoring_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/monitoring_governance]
module.policy_assignments.azurerm_role_assignment.monitoring_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleAssignments/11b280d6-da47-bf63-71b3-715fcce91c56]
module.policy_assignments.azurerm_role_assignment.security_governance: Refreshing state... [id=/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleAssignments/3d0ee71f-9e2a-5cc8-754b-8d7ae86273bf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.policy_assignments.azurerm_role_assignment.logging_governance will be created
  + resource "azurerm_role_assignment" "logging_governance" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c"
      + skip_service_principal_aad_check = true
    }

  # module.policy_assignments.azurerm_role_assignment.logging_governance_prod will be destroyed
  - resource "azurerm_role_assignment" "logging_governance_prod" {
      - id                               = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleAssignments/52c565a9-c475-2d56-021f-68d493c46458" -> null
      - name                             = "52c565a9-c475-2d56-021f-68d493c46458" -> null
      - principal_id                     = "c4c65f8d-841d-4518-9255-6ff5faae621a" -> null
      - principal_type                   = "ServicePrincipal" -> null
      - role_definition_id               = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name             = "Contributor" -> null
      - scope                            = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c" -> null
      - skip_service_principal_aad_check = true -> null
    }

  # module.policy_assignments.azurerm_subscription_policy_assignment.logging_governance will be created
  + resource "azurerm_subscription_policy_assignment" "logging_governance" {
      + description          = "Assignment of the Logging Governance initiative to subscription."
      + display_name         = "Logging Governance"
      + enforce              = true
      + id                   = (known after apply)
      + location             = "australiaeast"
      + metadata             = (known after apply)
      + name                 = "logging_governance"
      + policy_definition_id = (known after apply)
      + subscription_id      = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.policy_assignments.azurerm_subscription_policy_assignment.logging_governance_prod will be destroyed
  - resource "azurerm_subscription_policy_assignment" "logging_governance_prod" {
      - description          = "Assignment of the Logging Governance for Production initiative to subscription." -> null
      - display_name         = "Logging Governance for Production" -> null
      - enforce              = true -> null
      - id                   = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policyAssignments/logging_governance_prod" -> null
      - location             = "australiaeast" -> null
      - metadata             = jsonencode(
            {
              - createdBy = "e23ad4f0-c6b3-4dc7-b76b-61845881570a"
              - createdOn = "2021-08-19T06:31:31.7669233Z"
              - updatedBy = null
              - updatedOn = null
            }
        ) -> null
      - name                 = "logging_governance_prod" -> null
      - not_scopes           = [
          - "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DevelopmentInfrastructure",
        ] -> null
      - policy_definition_id = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/logging_governance_prod" -> null
      - subscription_id      = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c" -> null

      - identity {
          - principal_id = "c4c65f8d-841d-4518-9255-6ff5faae621a" -> null
          - tenant_id    = "1043afc5-d3ea-4e61-9112-b5514738101b" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # module.policyset_definitions.azurerm_policy_set_definition.logging_governance will be created
  + resource "azurerm_policy_set_definition" "logging_governance" {
      + description           = "Contains common Logging Governance policies"
      + display_name          = "Logging Governance"
      + id                    = (known after apply)
      + management_group_id   = (known after apply)
      + management_group_name = (known after apply)
      + metadata              = jsonencode(
            {
              + category = "Custom"
            }
        )
      + name                  = "logging_governance"
      + policy_definitions    = (known after apply)
      + policy_type           = "Custom"

      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + logAnalytics = {
                      + value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/951af2fa-529b-416e-ab6e-066fd85ac459"
          + reference_id         = "Deploy - Configure diagnostic settings for Azure Key Vault to Log Analytics workspace"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + logAnalytics = {
                      + value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6f8f98a4-f108-47cb-8e98-91a0d85cd474"
          + reference_id         = "Configure diagnostic settings for storage accounts to Log Analytics workspace"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + logAnalytics = {
                      + value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6c66c325-74c8-42fd-a286-a74b0e2939d8"
          + reference_id         = "Deploy - Configure diagnostic settings for Azure Kubernetes Service to Log Analytics workspace"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + logAnalytics = {
                      + value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/b79fa14e-238a-4c2d-b376-442ce508fc84"
          + reference_id         = "Deploy - Configure diagnostic settings for SQL Databases to Log Analytics workspace"
        }
      + policy_definition_reference {
          + parameter_values     = (known after apply)
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/a4034bc6-ae50-406d-bf76-50f4ee5a7811"
          + reference_id         = "Configure Linux virtual machines with Azure Monitor Agent"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + dcrResourceId = {
                      + value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
          + reference_id         = "(linuxSecurityLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + dcrResourceId = {
                      + value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
          + reference_id         = "(linuxPerformanceLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
        }
      + policy_definition_reference {
          + parameter_values     = (known after apply)
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/ca817e41-e85a-4783-bc7f-dc532d36235e"
          + reference_id         = "Configure Windows virtual machines with Azure Monitor Agent"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + dcrResourceId = {
                      + value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
          + reference_id         = "(windowsSecurityLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
        }
      + policy_definition_reference {
          + parameter_values     = jsonencode(
                {
                  + dcrResourceId = {
                      + value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
                    }
                }
            )
          + parameters           = (known after apply)
          + policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
          + reference_id         = "(windowsPerformanceLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
        }
    }

  # module.policyset_definitions.azurerm_policy_set_definition.logging_governance_dev will be destroyed
  - resource "azurerm_policy_set_definition" "logging_governance_dev" {
      - description        = "Contains common Logging Governance policies for Development" -> null
      - display_name       = "Logging Governance for Development" -> null
      - id                 = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/logging_governance_dev" -> null
      - metadata           = jsonencode(
            {
              - category  = "Custom"
              - createdBy = "e23ad4f0-c6b3-4dc7-b76b-61845881570a"
              - createdOn = "2021-08-19T06:07:19.7749942Z"
              - updatedBy = "e23ad4f0-c6b3-4dc7-b76b-61845881570a"
              - updatedOn = "2021-08-19T07:48:33.7974037Z"
            }
        ) -> null
      - name               = "logging_governance_dev" -> null
      - policy_definitions = jsonencode(
            [
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/951af2fa-529b-416e-ab6e-066fd85ac459"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for Azure Key Vault to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/6f8f98a4-f108-47cb-8e98-91a0d85cd474"
                  - policyDefinitionReferenceId = "Configure diagnostic settings for storage accounts to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/6c66c325-74c8-42fd-a286-a74b0e2939d8"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for Azure Kubernetes Service to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/b79fa14e-238a-4c2d-b376-442ce508fc84"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for SQL Databases to Log Analytics workspace"
                },
              - {
                  - parameters                  = {}
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/a4034bc6-ae50-406d-bf76-50f4ee5a7811"
                  - policyDefinitionReferenceId = "Configure Linux virtual machines with Azure Monitor Agent"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
                  - policyDefinitionReferenceId = "(linuxSecurityLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
                  - policyDefinitionReferenceId = "(linuxPerformanceLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {}
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/ca817e41-e85a-4783-bc7f-dc532d36235e"
                  - policyDefinitionReferenceId = "Configure Windows virtual machines with Azure Monitor Agent"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
                  - policyDefinitionReferenceId = "(windowsSecurityLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
                  - policyDefinitionReferenceId = "(windowsPerformanceLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
                },
            ]
        ) -> null
      - policy_type        = "Custom" -> null

      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/951af2fa-529b-416e-ab6e-066fd85ac459" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for Azure Key Vault to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6f8f98a4-f108-47cb-8e98-91a0d85cd474" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure diagnostic settings for storage accounts to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6c66c325-74c8-42fd-a286-a74b0e2939d8" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for Azure Kubernetes Service to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/b79fa14e-238a-4c2d-b376-442ce508fc84" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for SQL Databases to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameters           = {} -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/a4034bc6-ae50-406d-bf76-50f4ee5a7811" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure Linux virtual machines with Azure Monitor Agent" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(linuxSecurityLogs)Configure Association to link Linux virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(linuxPerformanceLogs)Configure Association to link Linux virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameters           = {} -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/ca817e41-e85a-4783-bc7f-dc532d36235e" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure Windows virtual machines with Azure Monitor Agent" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(windowsSecurityLogs)Configure Association to link Windows virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(windowsPerformanceLogs)Configure Association to link Windows virtual machines to Data Collection Rule" -> null
        }
    }

  # module.policyset_definitions.azurerm_policy_set_definition.logging_governance_prod will be destroyed
  - resource "azurerm_policy_set_definition" "logging_governance_prod" {
      - description        = "Contains common Logging Governance policies for Production" -> null
      - display_name       = "Logging Governance for Production" -> null
      - id                 = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/providers/Microsoft.Authorization/policySetDefinitions/logging_governance_prod" -> null
      - metadata           = jsonencode(
            {
              - category  = "Custom"
              - createdBy = "e23ad4f0-c6b3-4dc7-b76b-61845881570a"
              - createdOn = "2021-08-19T06:29:58.9787629Z"
              - updatedBy = "e23ad4f0-c6b3-4dc7-b76b-61845881570a"
              - updatedOn = "2021-08-19T06:58:17.9408155Z"
            }
        ) -> null
      - name               = "logging_governance_prod" -> null
      - policy_definitions = jsonencode(
            [
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/951af2fa-529b-416e-ab6e-066fd85ac459"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for Azure Key Vault to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/6f8f98a4-f108-47cb-8e98-91a0d85cd474"
                  - policyDefinitionReferenceId = "Configure diagnostic settings for storage accounts to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/6c66c325-74c8-42fd-a286-a74b0e2939d8"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for Azure Kubernetes Service to Log Analytics workspace"
                },
              - {
                  - parameters                  = {
                      - logAnalytics = {
                          - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/b79fa14e-238a-4c2d-b376-442ce508fc84"
                  - policyDefinitionReferenceId = "Deploy - Configure diagnostic settings for SQL Databases to Log Analytics workspace"
                },
              - {
                  - parameters                  = {}
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/a4034bc6-ae50-406d-bf76-50f4ee5a7811"
                  - policyDefinitionReferenceId = "Configure Linux virtual machines with Azure Monitor Agent"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
                  - policyDefinitionReferenceId = "(linuxSecurityLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74"
                  - policyDefinitionReferenceId = "(linuxPerformanceLogs)Configure Association to link Linux virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {}
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/ca817e41-e85a-4783-bc7f-dc532d36235e"
                  - policyDefinitionReferenceId = "Configure Windows virtual machines with Azure Monitor Agent"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
                  - policyDefinitionReferenceId = "(windowsSecurityLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
                },
              - {
                  - parameters                  = {
                      - dcrResourceId = {
                          - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
                        }
                    }
                  - policyDefinitionId          = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c"
                  - policyDefinitionReferenceId = "(windowsPerformanceLogs)Configure Association to link Windows virtual machines to Data Collection Rule"
                },
            ]
        ) -> null
      - policy_type        = "Custom" -> null

      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/951af2fa-529b-416e-ab6e-066fd85ac459" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for Azure Key Vault to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6f8f98a4-f108-47cb-8e98-91a0d85cd474" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure diagnostic settings for storage accounts to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/6c66c325-74c8-42fd-a286-a74b0e2939d8" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for Azure Kubernetes Service to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - logAnalytics = {
                      - value = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
                    }
                }
            ) -> null
          - parameters           = {
              - "logAnalytics" = "/subscriptions/xxxxxxxx/resourcegroups/xxxxxxxx/providers/microsoft.operationalinsights/workspaces/xxxxxxxx"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/b79fa14e-238a-4c2d-b376-442ce508fc84" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Deploy - Configure diagnostic settings for SQL Databases to Log Analytics workspace" -> null
        }
      - policy_definition_reference {
          - parameters           = {} -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/a4034bc6-ae50-406d-bf76-50f4ee5a7811" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure Linux virtual machines with Azure Monitor Agent" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxSecurityLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(linuxSecurityLogs)Configure Association to link Linux virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/linuxPerformanceLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/2ea82cdd-f2e8-4500-af75-67a2e084ca74" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(linuxPerformanceLogs)Configure Association to link Linux virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameters           = {} -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/ca817e41-e85a-4783-bc7f-dc532d36235e" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "Configure Windows virtual machines with Azure Monitor Agent" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsSecurityLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(windowsSecurityLogs)Configure Association to link Windows virtual machines to Data Collection Rule" -> null
        }
      - policy_definition_reference {
          - parameter_values     = jsonencode(
                {
                  - dcrResourceId = {
                      - value = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
                    }
                }
            ) -> null
          - parameters           = {
              - "dcrResourceId" = "/subscriptions/42482d91-3f4f-4012-8e45-78bf7ad4d60c/resourceGroups/DataCollectionRules/providers/Microsoft.Insights/dataCollectionRules/windowsPerformanceLogs"
            } -> null
          - policy_definition_id = "/providers/Microsoft.Authorization/policyDefinitions/eab1f514-22e3-42e3-9a1f-e1dc9199355c" -> null
          - policy_group_names   = [] -> null
          - reference_id         = "(windowsPerformanceLogs)Configure Association to link Windows virtual machines to Data Collection Rule" -> null
        }
    }

Plan: 3 to add, 0 to change, 4 to destroy.

```

</details>

*Pusher: @jesseloudon, Action: `pull_request`*